{"dictionary": {"Estelle": {"word": "Estelle", "part of speech": "noun", "definition": "a female given name: from a Latin word meaning “star.”"}, "videoporn": {"word": "videoporn", "part of speech": "noun", "definition": "pornographic movies available on videocassette or optical disk, on the internet, or on subscription television."}, "date": {"word": "date", "part of speech": "noun", "definition": "a particular month, day, and year at which some event happened or will happen: July 4, 1776 was the date of the signing of the Declaration of Independence. the day of the month: Is today's date the 7th or the 8th? an inscription on a writing, coin, etc., that shows the time, or time and place, of writing, casting, delivery, etc.: a letter bearing the date January 16. the time or period to which any event or thing belongs; period in general: at a late date. the time during which anything lasts; duration: The pity is that childhood has so short a date. an appointment for a particular time: They have a date with their accountant at ten o'clock. a social appointment or engagement arranged beforehand with another person, especially when a romantic relationship exists or may develop: to go out on a Saturday night date. a person with whom one has such a social appointment or engagement: Can I bring a date to the party? an engagement for an entertainer to perform.dates, the birth and death dates, usually in years, of a person: Dante's dates are 1265 to 1321. SEE MORESEE LESS"}, "force": {"word": "force", "part of speech": "noun", "definition": "physical power or strength possessed by a living being: He used all his force in opening the window.strength or power exerted upon an object; physical coercion; violence: to use force to open the window; to use force on a person.strength; energy; power; intensity: a personality of great force.power to influence, affect, or control; efficacious power: the force of circumstances; a force for law and order.Law. unlawful violence threatened or committed against persons or property.persuasive power; power to convince: They felt the force of his arguments.mental or moral strength: force of character.might, as of a ruler or realm; strength for war.Often forces. the military or fighting strength, especially of a nation.any body of persons combined for joint action: a sales force.intensity or strength of effect: the force of her acting.Physics.  an influence on a body or system, producing or tending to produce a change in movement or in shape or other effects. the intensity of such an influence. Symbol: F, fany influence or agency analogous to physical force: social forces.binding power, as of a contract.Baseball. force play. value; significance; meaning.Billiards. a stroke in which the cue ball is forcibly struck directly below the center in such a manner as to cause it to stop abruptly, bound back, or roll off to one side after hitting the object ball.SEE MORESEE LESS"}, "tormentor": {"word": "tormentor", "part of speech": "noun", "definition": "a person or thing that torments. Theater. a curtain or framed structure behind the proscenium at both sides of the stage, for screening the wings from the audience.Compare teaser (def. 2). "}, "tumorigenic": {"word": "tumorigenic", "part of speech": "adjective", "definition": "(of cells or a substance) capable of producing tumors. "}, "delete": {"word": "delete", "part of speech": "verb (used with object),", "definition": "to strike out or remove (something written or printed); cancel; erase; expunge."}, "spaz": {"word": "spaz", "part of speech": "noun", "definition": "an awkward or clumsy person."}, "ravage": {"word": "ravage", "part of speech": "verb (used with object),", "definition": "to work havoc upon; damage or mar by ravages: a face ravaged by grief."}, "matter": {"word": "matter", "part of speech": "noun", "definition": "the substance or substances of which any physical object consists or is composed: the matter of which the earth is made.physical or corporeal substance in general, whether solid, liquid, or gaseous, especially as distinguished from incorporeal substance, as spirit or mind, or from qualities, actions, and the like.something that occupies space.a particular kind of substance: coloring matter.a situation, state, affair, or business: a trivial matter.an amount or extent reckoned approximately: a matter of 10 miles.something of consequence: matter for serious thought.importance or significance: decisions of little matter.difficulty; problem; trouble: Whatever is the matter?There is something the matter with the car.ground, reason, or cause: a matter for complaint.the material or substance of a discourse, book, etc., often as distinguished from its form.things put down in words, especially printed: reading matter.things sent by mail: postal matter.a substance discharged by a living body, especially pus.Philosophy.  that which by integrative organization forms chemical substances and living things.Aristotelianism. that which relates to form as potentiality does to actuality.Law. statement or allegation.Printing.  material for work; copy. type set up.Christian Science. the concept of substance shaped by the limitations of the human mind.SEE MORESEE LESS"}, "blow-hard": {"word": "blow-hard", "part of speech": "noun", "definition": "an exceptionally boastful and talkative person."}, "convulse": {"word": "convulse", "part of speech": "verb (used with object),", "definition": "to shake violently; agitate. to cause to shake violently with laughter, anger, pain, etc.to cause to suffer violent, spasmodic contractions of the muscles."}, "appealing": {"word": "appealing", "part of speech": "adjective", "definition": "evoking or attracting interest, desire, curiosity, sympathy, or the like; attractive."}, "nice": {"word": "nice", "part of speech": "adjective,", "definition": "pleasing; agreeable; delightful: a nice visit.amiably pleasant; kind: They are always nice to strangers.characterized by, showing, or requiring great accuracy, precision, skill, tact, care, or delicacy: nice workmanship; a nice shot; a nice handling of a crisis.showing or indicating very small differences; minutely accurate, as instruments: a job that requires nice measurements.minute, fine, or subtle: a nice distinction.having or showing delicate, accurate perception: a nice sense of color.refined in manners, language, etc.: Nice people wouldn't do such things.virtuous; respectable; decorous: a nice girl.suitable or proper: That was not a nice remark.carefully neat in dress, habits, etc.(especially of food) dainty or delicate.having fastidious, finicky, or fussy tastes: They're much too nice in their dining habits to enjoy an outdoor barbecue.Obsolete. coy, shy, or reluctant.Obsolete. unimportant; trivial.Obsolete. wanton.SEE MORESEE LESS"}}}